/*
 Navicat MySQL Data Transfer

 Source Server         : 肖家豪
 Source Server Type    : MySQL
 Source Server Version : 50721
 Source Host           : i.27wy.cn
 Source Database       : tencent_vedio

 Target Server Type    : MySQL
 Target Server Version : 50721
 File Encoding         : utf-8

 Date: 03/09/2019 21:25:08 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `tbl_room`
-- ----------------------------
DROP TABLE IF EXISTS `tbl_room`;
CREATE TABLE `tbl_room` (
  `id` bigint(11) NOT NULL AUTO_INCREMENT COMMENT '房间号',
  `roomName` varchar(255) DEFAULT NULL COMMENT '房间名称',
  `meetingID` bigint(11) DEFAULT NULL COMMENT '会议ID',
  `createTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `endTime` timestamp NULL DEFAULT NULL COMMENT '结束时间',
  `actionTime` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `operator` varchar(255) DEFAULT NULL COMMENT '操作人',
  `groupID` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=85 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
--  Records of `tbl_room`
-- ----------------------------
BEGIN;
INSERT INTO `tbl_room` VALUES ('24', 'liudehua创建的房间', '134', '2019-03-07 09:41:10', null, '2019-03-07 09:41:11', 'liudehua', '@WSAP#24'), ('25', 'c132创建的房间', '135', '2019-03-07 09:45:11', null, '2019-03-07 09:45:12', 'c132', '@WSAP#25'), ('26', 'peng创建的房间', '136', '2019-03-07 09:51:23', null, '2019-03-07 09:51:24', 'peng', '@WSAP#26'), ('27', 'c132创建的房间', '132', '2019-03-07 09:56:18', null, '2019-03-07 09:56:19', 'c132', '@WSAP#27'), ('28', 'c132创建的房间', '137', '2019-03-07 09:56:22', null, '2019-03-07 09:56:23', 'c132', '@WSAP#28'), ('29', 'peng创建的房间', '138', '2019-03-07 10:03:26', null, '2019-03-07 10:03:27', 'peng', '@WSAP#29'), ('30', 'liudehua创建的房间', '139', '2019-03-07 10:38:50', null, '2019-03-07 10:38:51', 'liudehua', '@WSAP#30'), ('31', 'peng创建的房间', '131', '2019-03-07 10:39:29', null, '2019-03-07 10:39:30', 'peng', '@WSAP#31'), ('32', 'liudehua创建的房间', '140', '2019-03-07 10:46:53', null, '2019-03-07 10:46:53', 'liudehua', '@WSAP#32'), ('33', 'liudehua创建的房间', '141', '2019-03-07 10:52:21', null, '2019-03-07 10:52:22', 'liudehua', '@WSAP#33'), ('34', 'admin创建的房间', '142', '2019-03-07 10:58:58', null, '2019-03-07 10:58:59', 'admin', '@WSAP#34'), ('37', 'yff创建的房间', '36', '2019-03-07 14:00:39', null, '2019-03-07 14:00:40', 'yff', '@WSAP#37'), ('38', 'liudehua创建的房间', '144', '2019-03-07 14:20:16', null, '2019-03-07 14:20:17', 'liudehua', '@WSAP#38'), ('39', 'peng创建的房间', '147', '2019-03-07 14:33:46', null, '2019-03-07 14:33:47', 'peng', '@WSAP#39'), ('40', 'liudehua创建的房间', '148', '2019-03-07 14:37:53', null, '2019-03-07 14:37:54', 'liudehua', '@WSAP#40'), ('41', 'peng创建的房间', '149', '2019-03-07 14:42:04', null, '2019-03-07 14:42:05', 'peng', '@WSAP#41'), ('42', 'yff创建的房间', '0', '2019-03-07 15:02:11', null, '2019-03-07 15:43:04', 'yff', '@WSAP#42'), ('43', 'yff创建的房间', '0', '2019-03-07 15:43:19', null, '2019-03-07 15:59:41', 'yff', '@WSAP#43'), ('44', 'yff创建的房间', '0', '2019-03-07 16:00:40', null, '2019-03-07 16:05:59', 'yff', '@WSAP#44'), ('45', 'yff创建的房间', '35', '2019-03-07 16:06:13', null, '2019-03-07 16:06:14', 'yff', '@WSAP#45'), ('46', 'peng创建的房间', '154', '2019-03-07 18:38:38', null, '2019-03-07 18:38:38', 'peng', '@WSAP#46'), ('47', 'liudehua创建的房间', '155', '2019-03-07 19:36:07', null, '2019-03-07 19:36:08', 'liudehua', '@WSAP#47'), ('48', 'liudehua创建的房间', '156', '2019-03-07 19:42:36', null, '2019-03-07 19:42:37', 'liudehua', '@WSAP#48'), ('49', 'yf创建的房间', '34', '2019-03-07 19:53:25', null, '2019-03-07 19:53:26', 'yf', '@WSAP#49'), ('50', 'zhangsan创建的房间', '158', '2019-03-07 19:55:16', null, '2019-03-07 19:55:17', 'zhangsan', '@WSAP#50'), ('51', 'lisi创建的房间', '157', '2019-03-07 19:55:25', null, '2019-03-07 19:55:26', 'lisi', '@WSAP#51'), ('52', 'yf创建的房间', '37', '2019-03-07 19:56:03', null, '2019-03-07 19:56:04', 'yf', '@WSAP#52'), ('53', 'liudehua创建的房间', '160', '2019-03-08 11:13:05', null, '2019-03-08 11:13:06', 'liudehua', '@WSAP#53'), ('54', 'liudehua创建的房间', '161', '2019-03-08 11:20:12', null, '2019-03-08 11:20:13', 'liudehua', '@WSAP#54'), ('55', 'yff创建的房间', '2037', '2019-03-08 13:46:29', null, '2019-03-08 13:46:30', 'yff', '@WSAP#55'), ('56', 'hello创建的房间', '165', '2019-03-08 16:31:35', null, '2019-03-08 16:31:36', 'hello', '@WSAP#56'), ('57', 'liudehua创建的房间', '166', '2019-03-08 16:56:41', null, '2019-03-08 16:56:42', 'liudehua', '@WSAP#57'), ('58', 'liudehua创建的房间', '167', '2019-03-08 16:59:41', null, '2019-03-08 16:59:42', 'liudehua', '@WSAP#58'), ('59', 'zhangsan创建的房间', '168', '2019-03-08 17:04:17', null, '2019-03-08 17:04:17', 'zhangsan', '@WSAP#59'), ('60', 'wangwu创建的房间', '169', '2019-03-08 17:12:41', null, '2019-03-08 17:12:43', 'wangwu', '@WSAP#60'), ('61', 'wangwu创建的房间', '170', '2019-03-08 17:19:28', null, '2019-03-08 17:19:29', 'wangwu', '@WSAP#61'), ('62', 'liudehua创建的房间', '171', '2019-03-08 17:22:18', null, '2019-03-08 17:22:28', 'liudehua', '@WSAP#62'), ('63', 'liudehua创建的房间', '159', '2019-03-08 17:35:26', null, '2019-03-08 17:35:27', 'liudehua', '@WSAP#63'), ('64', 'zzyy创建的房间', '2038', '2019-03-08 18:20:38', null, '2019-03-08 18:20:45', 'zzyy', '@WSAP#64'), ('65', 'liudehua创建的房间', '173', '2019-03-08 18:40:52', null, '2019-03-08 18:40:53', 'liudehua', '@WSAP#65'), ('66', 'liudehua创建的房间', '174', '2019-03-08 18:45:52', null, '2019-03-08 18:45:53', 'liudehua', '@WSAP#66'), ('67', 'liudehua创建的房间', '175', '2019-03-08 18:47:00', null, '2019-03-08 18:47:00', 'liudehua', '@WSAP#67'), ('68', 'liudehua创建的房间', '176', '2019-03-08 18:48:23', null, '2019-03-08 18:48:23', 'liudehua', '@WSAP#68'), ('69', 'liudehua创建的房间', '177', '2019-03-08 18:50:25', null, '2019-03-08 18:50:26', 'liudehua', '@WSAP#69'), ('70', 'zzy创建的房间', '38', '2019-03-08 19:31:31', null, '2019-03-08 19:33:13', 'zzy', '@WSAP#70'), ('71', 'yf创建的房间', '1039', '2019-03-08 20:13:00', null, '2019-03-08 20:13:01', 'yf', '@WSAP#71'), ('72', 'yf创建的房间', '1040', '2019-03-08 20:19:22', null, '2019-03-08 20:19:23', 'yf', '@WSAP#72'), ('73', 'yf创建的房间', '1042', '2019-03-08 20:20:02', null, '2019-03-08 20:20:03', 'yf', '@WSAP#73'), ('74', 'yf创建的房间', '1043', '2019-03-08 20:20:49', null, '2019-03-08 20:20:50', 'yf', '@WSAP#74'), ('75', 'yf创建的房间', '1044', '2019-03-08 20:21:35', null, '2019-03-08 20:21:36', 'yf', '@WSAP#75'), ('76', 'yf创建的房间', '1045', '2019-03-08 20:22:26', null, '2019-03-08 20:22:27', 'yf', '@WSAP#76'), ('77', 'yf创建的房间', '1046', '2019-03-08 20:23:59', null, '2019-03-08 20:24:00', 'yf', '@WSAP#77'), ('78', 'yf创建的房间', '1047', '2019-03-08 20:43:50', null, '2019-03-08 20:43:51', 'yf', '@WSAP#78'), ('79', 'yf创建的房间', '1048', '2019-03-08 20:44:56', null, '2019-03-08 20:44:57', 'yf', '@WSAP#79'), ('80', 'yf创建的房间', '1049', '2019-03-08 20:45:37', null, '2019-03-08 20:45:38', 'yf', '@WSAP#80'), ('81', 'yf创建的房间', '1053', '2019-03-08 21:26:42', null, '2019-03-08 21:26:43', 'yf', '@WSAP#81'), ('82', 'yf创建的房间', '1052', '2019-03-08 21:27:53', null, '2019-03-08 21:27:54', 'yf', '@WSAP#82'), ('83', 'test创建的房间', '10000', '2019-03-08 21:48:41', null, '2019-03-08 21:48:42', 'test', '@WSAP#83'), ('84', 'test创建的房间', '10001', '2019-03-08 22:12:27', null, '2019-03-08 22:12:28', 'test', '@WSAP#84');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
